[
  {
    "section": 1,
    "title": "Let's get started (aka the easy stuff)",
    "questions": [
      { "id": 1, "text": "Kissed anyone on their head/neck region as a friendly gesture?" },
      { "id": 2, "text": "Held hands with someone?" },
      { "id": 3, "text": "Had a date?" },
      { "id": 4, "text": "Had a date past 1 a.m.?" },
      { "id": 5, "text": "Dated someone on a regular basis?" },
      { "id": 6, "text": "Picked someone up?" },
      { "id": 7, "text": "Been picked up?" },
      { "id": 8, "text": "Gone steady?" },
      { "id": 9, "text": "Slow danced?" },
      { "id": 10, "text": "Shared sleeping accommodations with someone without steamy happenings?" },
      { "id": 11, "text": "Given a back or neck rub or massage with no ulterior motive?" },
      { "id": 12, "text": "Used tickling as a pick-up, get-to-know-you-better routine?" },
      { "id": 13, "text": "Asked someone who was not your SO (or had ever been) if they were a virgin?" },
      { "id": 14, "text": "Used physical prowess as a pickup routine?" },
      { "id": 15, "text": "Secretly lusted after someone without that person knowing?" },
      { "id": 16, "text": "Dropped subtle hints to someone whom you liked, hoping for a reaction?" },
      { "id": 17, "text": "Written anonymous 'love letters' to someone?" },
      { "id": 18, "text": "Created an online dating/meetup account? (Tinder, Hinge, Bumble, Grindr, etc.)" }
    ]
  },
  {
    "section": 2,
    "title": "AutoErotica & Monosexualism (I Think I'm Alone Now)",
    "questions": [
      { "id": 19, "text": "Had an arousing dream? (wet dreams and the like)" },
      { "id": 20, "text": "Been sexually aroused?" },
      { "id": 21, "text": "Verbally expressed obscenities?" },
      { "id": 22, "text": "Fantasized about someone in a superior position to you?" },
      { "id": 23, "text": "Fantasized about someone in a professional relationship with you?" },
      { "id": 24, "text": "Fantasized about someone you know personally but not closely?" },
      { "id": 25, "text": "Fantasized about anyone and masturbated at the same time?" },
      { "id": 26, "text": "Read or bought pornographic periodicals?" },
      { "id": 27, "text": "Ever had a subscription to pornographic periodicals?" },
      { "id": 28, "text": "Read sexually explicit literature?" },
      { "id": 29, "text": "Gone skinny dipping alone?" },
      { "id": 30, "text": "Stuffed your bra or pants?" },
      { "id": 31, "text": "Shaved your genital pubic hair?" },
      { "id": 32, "text": "Shaved your genital pubic hair on a fairly regular basis?" },
      { "id": 33, "text": "Colored or bleached your genital pubic hair?" },
      { "id": 34, "text": "Shaved or shaped your genital pubic hair in a particular design?" },
      { "id": 35, "text": "Masturbated?" },
      { "id": 36, "text": "Masturbated at least five times in one twenty-four hour period?" },
      { "id": 37, "text": "Masturbated on a fairly regular basis of no less than once a fortnight?" },
      { "id": 38, "text": "Masturbated where you could have been discovered?" },
      { "id": 39, "text": "Masturbated out in the wilds or in nature with no nearby civilization?" },
      { "id": 40, "text": "Masturbated to orgasm?" },
      { "id": 41, "text": "Masturbated while reading sexually explicit material or looking at naked photos?" },
      { "id": 42, "text": "Masturbated while driving a *moving* land vehicle?" },
      { "id": 43, "text": "Masturbated while on the phone? (no kinky interpretations of ‘on the phone’)" },
      { "id": 44, "text": "Masturbated while in a bathroom of the opposite sex?" },
      { "id": 45, "text": "Masturbated while watching an r or x-rated show/adult movie/porn video clip?" },
      { "id": 46, "text": "Seen any burlesque show? (rocky horror counts)" },
      { "id": 47, "text": "Been to a peep show?" },
      { "id": 48, "text": "Been to a private showing of a pornographic movie?" },
      { "id": 49, "text": "Seen a pornographic movie in a theater?" },
      { "id": 50, "text": "Walked around in your room/apartment/house/habitation in the nude?" },
      { "id": 51, "text": "Walked around in a public area with a top but no bottom?" },
      { "id": 52, "text": "Bought blatant sexual objects?" },
      { "id": 53, "text": "Owned any erotic art pieces?" },
      { "id": 54, "text": "Written down your own stories or fantasies for masturbatory purposes?" },
      { "id": 55, "text": "Sculpted erotic/obscene artworks in food (bananas, carrots, apples, etc.)?" },
      { "id": 56, "text": "Eaten any erotic food items? (chocolate tits, banana dicks, etc.)" },
      { "id": 57, "text": "Sculpted erotic/obscene artworks in any carvable material other than food?" },
      { "id": 58, "text": "Made an x- or r-rated snowman or snowwoman?" },
      { "id": 59, "text": "Tasted your own orgasmic liquids?" },
      { "id": 60, "text": "Inserted your finger into your rectum?" },
      { "id": 61, "text": "Used ben-wa balls or anal beads?" },
      { "id": 62, "text": "Performed oral sex on yourself? (yes, this is possible for some people)" },
      { "id": 63, "text": "Willingly urinated on the garments that you were wearing at the time?" },
      { "id": 64, "text": "Willingly urinated on any part of your body?" },
      { "id": 65, "text": "Willingly defecated on the garments that you were wearing at the time?" },
      { "id": 66, "text": "Willingly defecated on yourself?" }
    ]
  },
  {
    "section": 3,
    "title": "The Socials/Modern Communication (I'm Shy, Here's My Asshole)",
    "questions": [
      { "id": 67, "text": "Either sent a dick pick or asked to receive a dick pic? (receiving an unsolicited dick pic does NOT count!)" },
      { "id": 68, "text": "Sexted?" },
      { "id": 69, "text": "Had good ol’ fashioned phone sex?" },
      { "id": 70, "text": "Made obscene phone calls/sent obscene text messages to random phone numbers?" },
      { "id": 71, "text": "Facetimed/Video-called a person for visual phone sex? (cybering)" },
      { "id": 72, "text": "Used an online communication platform like Discord, Google Chat, etc. for audio and/or video sex chat with someone?" },
      { "id": 73, "text": "Posted a “mild” pic of yourself on the internet that’s non-nude but suggestive? (personal website, reddit, tumblr, instagram, FB, etc.)" },
      { "id": 74, "text": "Posted a topless pic of yourself on the internet?" },
      { "id": 75, "text": "Posted a fully nude pic of yourself on the internet where your face is not revealed?" },
      { "id": 76, "text": "Gone all the way and posted a fully nude pic of yourself, face and all?" },
      { "id": 77, "text": "Posted a pic of your butt hole on the internet for the world to see?" },
      { "id": 78, "text": "Posted a video clip of you partially/fully naked?" },
      { "id": 79, "text": "Posted a video clip of you masturbating/playing with toys?" },
      { "id": 80, "text": "Posted a video clip of you having sex with someone else?" },
      { "id": 81, "text": "Posted a video clip in which you orgasm?" },
      { "id": 82, "text": "Created an OnlyFans (or any similar such website) account to which you have posted pics/vids in an attempt to earn money?" }
    ]
  },
  {
    "section": 4,
    "title": "Legislative Misfits and Other Ethical Things",
    "questions": [
      { "id": 83, "text": "Administered a whole purity test" },
      { "id": 84, "text": "Taken purity tests of any versions more than 5 times?" },
      { "id": 85, "text": "Lied on any previous purity tests?" },
      { "id": 86, "text": "Exaggerated about any sexual experiences?" },
      { "id": 87, "text": "Gone to (or escorted someone to) a planned parenthood clinic?" },
      { "id": 88, "text": "Broken your word, promise, or vow?" },
      { "id": 89, "text": "Lied to someone at someone else's request?" },
      { "id": 90, "text": "Lied about your sexual preference in order to avoid a date?" },
      { "id": 91, "text": "Ever committed a crime to which you would be subject to a fine and have a criminal record? (so, we’re not talking speeding or parking in a handicap spot here)" },
      { "id": 92, "text": "Ever committed a crime to which you would be subject to imprisonment?" },
      { "id": 93, "text": "Seen a snuff film?" },
      { "id": 94, "text": "Read someone else's diary without their knowledge and/or consent?" },
      { "id": 95, "text": "Searched someone's room without their knowledge and/or consent?" },
      { "id": 96, "text": "Told someone that you loved them when you did not?" },
      { "id": 97, "text": "Told someone that you loved them so you could have sex with them?" },
      { "id": 98, "text": "Fantasized about other people than your partner during sexual activities?" },
      { "id": 99, "text": "Intentionally listened in on other people having sex, oral sex, etc?" },
      { "id": 100, "text": "Used alcohol to lower someone else's inhibitions for the purpose of sex?" },
      { "id": 101, "text": "Used drugs to lower someone else's inhibitions for the purpose of sex?" },
      { "id": 102, "text": "Drugged someone without their knowledge and/or consent?" },
      { "id": 103, "text": "Forced or coerced someone into having intimate relations with you?" },
      { "id": 104, "text": "Had multiple dates on one night with one or more parties unaware of the other?" },
      { "id": 105, "text": "Had multiple dates on one night where all parties were aware of each other?" },
      { "id": 106, "text": "Gone steady with two or more people at the same time ?" },
      { "id": 107, "text": "Gone steady with two or more people at the same time while all aware of it?" },
      { "id": 108, "text": "Urinated on someone else intentionally?" },
      { "id": 109, "text": "Urinated in any receptacle that was not designed for the purpose?" },
      { "id": 110, "text": "Urinated anywhere other than a bathroom, outhouse, tree, bush or any commonly accepted pisshole?" },
      { "id": 111, "text": "Urinated from higher than the fifth floor, or equivalent thereof?" },
      { "id": 112, "text": "Defecated anywhere other than a bathroom, outhouse or such?" },
      { "id": 113, "text": "Stored any excreta in a refrigerator, oven, or any food storage device?" },
      { "id": 114, "text": "Stored evacuated excreta anywhere else?" },
      { "id": 115, "text": "Entered a bathroom of the opposite sex, unaccompanied by someone of the opposite sex, while not involved in a search and/or rescue mission?" },
      { "id": 116, "text": "Mooned or flashed someone from the front?" },
      { "id": 117, "text": "Farted (audibly) in mixed company?" },
      { "id": 118, "text": "Streaked, flashed, or otherwise exposed yourself in public?" },
      { "id": 119, "text": "Streaked, flashed, or otherwise exposed pretty much totally yourself in public before a formal (official) gathering of people?" },
      { "id": 120, "text": "Been arrested? (picture taken and all that wonderful, free stuff.)" },
      { "id": 121, "text": "Received money or some favor to have sex, oral sex, or mutual masturbation with someone?" },
      { "id": 122, "text": "Given money or some favor to have sex, oral sex, or mutual masturbation with someone?" },
      { "id": 123, "text": "Thought you might be, or might have caused someone else to be, unintentionally pregnant?" },
      { "id": 124, "text": "Bought a home pregnancy test?" },
      { "id": 125, "text": "Bought condoms?" },
      { "id": 126, "text": "Borrowed/stolen/taken birth control devices from your or someone else's parents? (condoms, spermicidal foam, diaphragms, chastity belt)" },
      { "id": 127, "text": "Had, or given someone, an unwanted pregnancy?" },
      { "id": 128, "text": "Lied about being pregnant or about having made someone pregnant?" },
      { "id": 129, "text": "Had sex while either you or your partner, but not both, were under the legal age of consent of the state/province/country in which you were having sex?" },
      { "id": 130, "text": "Thought you had an STI?" },
      { "id": 131, "text": "Had an STI of any sort (the clap, crabs, herpes, etc.)" },
      { "id": 132, "text": "Had an AIDS test due to reasonable suspicion or hyperactive imagination?" },
      { "id": 133, "text": "Given a sympathy fuck?" },
      { "id": 134, "text": "Initiated sex with someone for the sake of sex only?" },
      { "id": 135, "text": "Willingly committed incest?" },
      { "id": 136, "text": "Committed adultery? (you need not have been the one who was married to get this point.)" },
      { "id": 137, "text": "Bought lingerie/undergarments of the opposite sex?" },
      { "id": 138, "text": "Stolen the underwear of someone you knew, for a purpose other than that of a practical joke or to just ire the person?" },
      { "id": 139, "text": "Intentionally taken someone's underwear and didn't know who it belonged to?" },
      { "id": 140, "text": "Gave money or favors for sex, oral sex, or mutual masturbation?" },
      { "id": 141, "text": "Received money or favors for sex, oral sex, or mutual masturbation?" },
      { "id": 142, "text": "Been aroused at the thought/sight of a child? (defined as below the age of consent for the activity involved)" },
      { "id": 143, "text": "Done anything with a child? (defined as below the age of consent for the activity involved)" },
      { "id": 144, "text": "Read a story or watched a video involving adults having sex with minors?" }
    ]
  },
  {
    "section": 5,
    "title": "Drugs (I Believe I Can Fly)",
    "questions": [
      { "id": 145, "text": "Had an alcoholic drink?" },
      { "id": 146, "text": "Been intoxicated?" },
      { "id": 147, "text": "Had sex while drunk?" },
      { "id": 148, "text": "Ever consumed drugs? (excluding alocohol)" },
      { "id": 149, "text": "Ever had sex under the infulence of drugs? (excluding alcohol)" },
      { "id": 150, "text": "Played any games in which there was a mystery as to who would be getting drugs and who wouldn't, yet everybody plays in it?" },
      { "id": 151, "text": "Gone to class or work while under the influence of drugs?(alcohol ok)" },
      { "id": 152, "text": "Mixed drugs? (alcohol counts. mixed meaning being under the influence of two or more drugs at once.)" },
      { "id": 153, "text": "Sold possessions in order to obtain drugs?" }
    ]
  },
  {
    "section": 6,
    "title": "Non-Platonic Relations (Aww, You're a couple now!)",
    "questions": [
      { "id": 154, "text": "Propositioned someone for necking or petting?" },
      { "id": 155, "text": "Propositioned someone for sex, oral sex, or mutual masturbation?" },
      { "id": 156, "text": "Pinched or patted someone else's buttocks?" },
      { "id": 157, "text": "French kissed?" },
      { "id": 158, "text": "Been kissed below the neck but not including arms or hands?" },
      { "id": 159, "text": "Kissed someone else below the neck but not including arms or hands?" },
      { "id": 160, "text": "Necked?" },
      { "id": 161, "text": "Petted above the waist?" },
      { "id": 162, "text": "Petted below the waist?" },
      { "id": 163, "text": "Kissed on the first date?" },
      { "id": 164, "text": "Necked on the first date?" },
      { "id": 165, "text": "Petted above the waist on the first date?" },
      { "id": 166, "text": "Petted below the waist on the first date?" },
      { "id": 167, "text": "Given a hickey?" },
      { "id": 168, "text": "Received a hickey?" },
      { "id": 169, "text": "Worn specific clothes for the purpose of hiding hickeys?" },
      { "id": 170, "text": "Fondled or stroked someone else's bare legs?" },
      { "id": 171, "text": "Fondled or stroked someone else's frontal chest/torso region?" },
      { "id": 172, "text": "Had your frontal chest/torso region fondled or stroked?" },
      { "id": 173, "text": "Been involved with pelvic thrusting while fully clothed? (dry humping)" },
      { "id": 174, "text": "Had your fingers licked or sucked?" },
      { "id": 175, "text": "Licked or sucked someone else's finger(s)?" },
      { "id": 176, "text": "Had your ear or ear region licked, breathed upon, sucked, or nibbled?" },
      { "id": 177, "text": "Licked, breathed onto, sucked, or nibbled an ear or ear region?" },
      { "id": 178, "text": "Fondled someone who was asleep?" },
      { "id": 179, "text": "Given a back massage with ulterior motives?" },
      { "id": 180, "text": "Given a back massage that led to something steamier?" },
      { "id": 181, "text": "Attempted to seduce someone?" },
      { "id": 182, "text": "Allowed yourself to be seduced?" },
      { "id": 183, "text": "Seen someone else completely nude when that person was under good lighting conditions?" },
      { "id": 184, "text": "Been seen completely nude by someone else under good lighting conditions?" },
      { "id": 185, "text": "Been in someone's company while both of you were completely nude?" },
      { "id": 186, "text": "Bathed or showered with someone?" },
      { "id": 187, "text": "Let someone else wash you while you were perfectly capable of doing it yourself." },
      { "id": 188, "text": "Gone skinny dipping in mixed company?" },
      { "id": 189, "text": "Been involved with the stroking or fondling of a woman's bare breast (as either possessor or fondler of the breast)?" },
      { "id": 190, "text": "Licked, sucked, or nibbled on someone else's nipple?" },
      { "id": 191, "text": "Had your nipple licked, sucked, or nibbled upon?" },
      { "id": 192, "text": "Petted, stroked, fondled, or otherwise handled someone else's covered genitals?" },
      { "id": 193, "text": "Had your covered genitals petted, stroked, fondled, or otherwise handled?" },
      { "id": 194, "text": "Petted, stroked, fondled, or otherwise handled someone else's bare genitals?" },
      { "id": 195, "text": "Had your bare genitals petted, stroked, fondled, or otherwise handled?" },
      { "id": 196, "text": "Had an orgasm while petting?" },
      { "id": 197, "text": "Given your partner an orgasm while petting?" },
      { "id": 198, "text": "Given finger scratch marks?" },
      { "id": 199, "text": "Received finger scratch marks?" },
      { "id": 200, "text": "Drawn blood by scratching or biting during sex? (hickeys do not count as having drawn blood)" },
      { "id": 201, "text": "Given or received *scars* from scratches or bites made during sex?" },
      { "id": 202, "text": "Performed oral sex?" },
      { "id": 203, "text": "Received oral sex?" },
      { "id": 204, "text": "Swallowed semen, or licked female liquids off of fingers?" },
      { "id": 205, "text": "Done sixty-nine?" },
      { "id": 206, "text": "Received manual sex?" },
      { "id": 207, "text": "Given manual sex?" },
      { "id": 208, "text": "Performed mutual masturbation?" },
      { "id": 209, "text": "Had sex? (using whatever definition you decide is appropriate)" },
      { "id": 210, "text": "Had sex on the first date?" },
      { "id": 211, "text": "Had sex without the use of birth control devices?" },
      { "id": 212, "text": "Had sex with a virgin? (not yourself)" },
      { "id": 213, "text": "Had sex with someone whose name you did not know? (and *still* don't know)" },
      { "id": 214, "text": "Had sex with someone whose face you never saw?" },
      { "id": 215, "text": "Had sex with someone where there was an age difference of more than 20 years?" },
      { "id": 216, "text": "Had sex with someone not of your own race?" },
      { "id": 217, "text": "Had sex with a religious officiary? (priest, nun, mother-superior, cardinal, pope, deity, etc.)" },
      { "id": 218, "text": "Had anal sex? (the use of fingers or any phallic objects in this case would also count)" }
    ]
  },
  {
    "section": 7,
    "title": "Fetish What? Fetish This!",
    "introduction": "Answer yes ONLY if you partake in the fetish on a serious basis! Trying it once or twice does NOT count!",
    "questions": [
      { "id": 219, "text": "Practiced bestiality?" },
      { "id": 220, "text": "Practiced sadism ?" },
      { "id": 221, "text": "Practiced masochism ?" },
      { "id": 222, "text": "Practiced bondage?" },
      { "id": 223, "text": "Practiced domination?" },
      { "id": 224, "text": "Practiced submission?" },
      { "id": 225, "text": "Practiced cocrophilia (a marked interest in excrement; esp. the use of feces or filth for sexual excitement)?" },
      { "id": 226, "text": "Practiced frotteurism (masturbation by rubbing against another's person or the need to rub against another stranger)?" },
      { "id": 227, "text": "Practiced klismaphilia (a dependency on being given an enema)?" },
      { "id": 228, "text": "Practiced necrophilia (copulation with a corpse)?" },
      { "id": 229, "text": "Practiced scoptophilia (a dependency on looking at sexual organs and watching sexual activity openly, not surreptitiously, as in voyeurism)?" },
      { "id": 230, "text": "Practiced urophilia (being dependently responsive to the smell or taste of urine or the sight and sound of someone urinating)?" },
      { "id": 231, "text": "Practiced role-playing (nurse-patient, teacher-student, border guard-confused traveller, etc.)?" },
      { "id": 232, "text": "Owned an underwear collection of underwear not belonging to you?" },
      { "id": 233, "text": "Been a foot fetishist to any degree?" },
      { "id": 234, "text": "Been a leather fetishist to any degree?" },
      { "id": 235, "text": "Been a rubber/latex fetishist to any degree?" },
      { "id": 236, "text": "Been a voyeur?" },
      { "id": 237, "text": "Been an exhibitionist?" }
    ]
  },
  {
    "section": 8,
    "title": "Group Sexual Relations (Step Right In, Leave Your Keys in the Bowl)",
    "questions": [
      { "id": 238, "text": "Discussed masturbation? (bringing up the topic of masturbation during purity testing does not cut it as discussing masturbation.)" },
      { "id": 239, "text": "Been a participant in a who's-physically-better-equipped verification contest?" },
      { "id": 240, "text": "Been a judge in a contest such as above?" },
      { "id": 241, "text": "Watched a porn movie in mixed company?" },
      { "id": 242, "text": "Watched a porn movie with your own or someone else's parents?" },
      { "id": 243, "text": "Played a game which may require you or others to disrobe?" },
      { "id": 244, "text": "Played a game which may require you or others to perform an action on another participant?" },
      { "id": 245, "text": "Been in intimate contact with more than one person at the same time while all of you were nude?" },
      { "id": 246, "text": "Had oral sex with more than 10 people? (not necessarily at one time)" },
      { "id": 247, "text": "Had sex with more than 10 people? (not necessarily at one time)" },
      { "id": 248, "text": "Had sex with more than 1 person in a 24 hour period?" },
      { "id": 249, "text": "Had sex with both genders in a 24 hour period?" },
      { "id": 250, "text": "Been in a menage-a-trois with at least one member of the opposite sex?" },
      { "id": 251, "text": "Been in a menage-a-trois of people of the same sex?" },
      { "id": 252, "text": "Walked in on others having sex (committed an 'oops') and then joined in?" },
      { "id": 253, "text": "Had sex or oral sex with a person and his/her parent? (not necessarily at the same time)" },
      { "id": 254, "text": "Had sex, oral sex, mutual masturbation, necking, or petting with a person and his/her sibling? (not necessarily at the same time)" },
      { "id": 255, "text": "Been involved in a two (or more) in one? (oral & anal or vaginal & anal counts. but no fingers - we're talking the real thing here)" },
      { "id": 256, "text": "Been involved in a gang bang? (step right up; come and get it while it's hot)" },
      { "id": 257, "text": "Been in a 69 circle?" },
      { "id": 258, "text": "Played naked Twister?" },
      { "id": 259, "text": "Participated in a heterosexual orgy or been involved in group sex? (four people or more; partners must be exchanged)" },
      { "id": 260, "text": "Been involved in group sex, with all participants of the same sex? (4 or more people, partners must be exchanged)" },
      { "id": 261, "text": "Participated in a bisexual orgy or group sex? (four people or more; partners must be exchanged)" },
      { "id": 262, "text": "Propositioned a person or group of people for group sex?" },
      { "id": 263, "text": "Participated in a fuck-a-thon? (where the object is to see how many times you can do it in a certain amount of time)" }
    ]
  },
  {
    "section": 9,
    "title": "Non-Sentient Objects (Why Yes, That Apple Pie Is Warm!)",
    "questions": [
      { "id": 264, "text": "Used a bowling pin, coke bottle, or something along those general shapes for masturbatory or sexual purposes?" },
      { "id": 265, "text": "Masturbated using the aid of food?" },
      { "id": 266, "text": "Eaten the food used in masturbation after masturbation?" },
      { "id": 267, "text": "Eaten a lab dissection?" },
      { "id": 268, "text": "Inserted food into your or someone else's anus?" },
      { "id": 269, "text": "Eaten food after it was extracted/evacuated from your or someone else's anus?" },
      { "id": 270, "text": "Received an enema for a purpose other than medical?" },
      { "id": 271, "text": "Received an enema consisting of a non-normal enema solution (wine, beer, urine, windex)?" },
      { "id": 272, "text": "Used a non-normal means of receiving the enema? (handheld shower house, garden hose, fire hose, etc.)" },
      { "id": 273, "text": "Actually measured your own or someone else's penis? (i.e., actually grabbed a ruler, yardstick, tape measure, etc.)" },
      { "id": 274, "text": "Used a mechanical hand-holdable device in aiding or replacing masturbation? (vibrator, massager, dustbuster, vacuum cleaner, etc.)" },
      { "id": 275, "text": "Used a feather or any other tickling device for the purpose of tickling?" },
      { "id": 276, "text": "Used tickling as a form of *arousal*?" },
      { "id": 277, "text": "Used ice for sexual purposes?" },
      { "id": 278, "text": "Used ice or something frozen as a dildo? (ice cubes don't count here - icicles, popsicles, and the like. penetration)" },
      { "id": 279, "text": "Used a strap-on dildo or male extension sheath?" },
      { "id": 280, "text": "Pegged a guy or, as a guy, been pegged?" },
      { "id": 281, "text": "Used whipped cream for sexual purposes?" },
      { "id": 282, "text": "Used hot/melted wax for sexual purposes?" },
      { "id": 283, "text": "Had sex in front of or under a mirror?" },
      { "id": 284, "text": "Put food, gravy, syrup, salad dressing, candy, peanut butter, honey or anything else edible on your partner's body, and then eaten it?" },
      { "id": 285, "text": "Used household syrup, sandwich spreading, oil, salad dressing, or any like substance for sexual purposes?" },
      { "id": 286, "text": "Used ropes, chains, cuffs or any other such device for bondage purposes?" },
      { "id": 287, "text": "Used a whip, chain, cat-o-nine-tails, or something similar for pain?" },
      { "id": 288, "text": "Worn edible underwear/lingerie?" },
      { "id": 289, "text": "Eaten edible underwear/lingerie off of someone?" },
      { "id": 290, "text": "Worn a leather (or leather-like) catsuit style outfit for a sexual purpose?" },
      { "id": 291, "text": "Worn diapers for a sexual or masturbatory purpose?" },
      { "id": 292, "text": "Used a ball gag or other manufactured gag?" },
      { "id": 293, "text": "Worn a collar and/or leash?" },
      { "id": 294, "text": "Been completely tied down (spreadeagled, hogtied, etc.)?" },
      { "id": 295, "text": "Tied someone down completely?" },
      { "id": 296, "text": "Had sex while you or your partner was tied up?" },
      { "id": 297, "text": "Used nipple clips? (clothespins count)" },
      { "id": 298, "text": "Pierced a part of your body other than your ears or nose? (nipples, labia, head of penis, etc.)" },
      { "id": 299, "text": "Used an inflatable doll?" },
      { "id": 300, "text": "Worn a butt plug during sex?" },
      { "id": 301, "text": "Worn a butt plug for longer periods of time as you go about your day-to-day activities out and about in the world?" },
      { "id": 302, "text": "Humped an inanimate object? (pillow, (dinner) liver, hole in the wall, sausage, banana, etc.)" },
      { "id": 303, "text": "Had sex or oral sex with a dead person?" },
      { "id": 304, "text": "Inserted a small animal or creature into your rectum? (either alive or dead)" },
      { "id": 305, "text": "Had sex or oral sex with your (dead) dinner animal?" },
      { "id": 306, "text": "Watched animals having sex?" },
      { "id": 307, "text": "Been aroused by the sight of animals having sex?" },
      { "id": 308, "text": "Done anything with animals?" },
      { "id": 309, "text": "Read a story or watched a video involving sex between humans and animals?" },
      { "id": 310, "text": "Cross dressed in the *undergarments* of the opposite sex for a sexual purpose? (this means that school plays, initiations, and the like don't count)" },
      { "id": 311, "text": "Cross dressed in the *undergarments* of the opposite sex for a sexual purpose in the presence of 1 or more other people? (plays and the like still don't count - this is for a sexual purpose)" },
      { "id": 312, "text": "Stuffed your pants or bra while you were cross-dressed for your sexual purpose?" },
      { "id": 313, "text": "Had your head inserted into a urinal or toilet bowl willingly?" },
      { "id": 314, "text": "Worn groinal underwear on your head? (panties, jock-strap, etc.)" },
      { "id": 315, "text": "Eaten, sucked, licked, nibbled, or otherwise inserted a used, unwashed piece of groinal underwear into your mouth while said underwear was not being worn at the time?" },
      { "id": 316, "text": "Deliberately sniffed or smelled a used, unwashed piece of groinal underwear while it was not being worn at the time?" },
      { "id": 317, "text": "Been gagged with someone's underwear? (not your own)" },
      { "id": 318, "text": "Played in or with shit?" },
      { "id": 319, "text": "Worn or used a condom or any feminine hygiene contraption that has already been used by someone else?" },
      { "id": 320, "text": "Used the wetspot to brew tea and then drink it?" }
    ]
  },
  {
    "section": 10,
    "title": "Localities (Geoguess This!)",
    "questions": [
      { "id": 321, "text": "Necked or petted in a place of religion? (church, temple, altar, grand holy cabbage head patch, etc.)" },
      { "id": 322, "text": "Had sex or been involved in oral sex or mutual masturbation in a place of religion?" },
      { "id": 323, "text": "Necked or petted in a place of the dead? (morgue, mortuary, cemetery, etc.)" },
      { "id": 324, "text": "Had sex or been involved in oral sex or mutual masturbation in a place of the dead?" },
      { "id": 325, "text": "Necked or petted in a contraption of the dead? (coffin, hearse, body bag, etc.)" },
      { "id": 326, "text": "Had sex or been involved in oral sex or mutual masturbation in a contraption of the dead?" },
      { "id": 327, "text": "Had sex in/on a construction site? (house, office, launch platform, etc.)" },
      { "id": 328, "text": "Necked or petted in a motor vehicle? (SUV, van, car, truck, semi, bulldozer, etc.)" },
      { "id": 329, "text": "Had sex or been involved in oral sex or mutual masturbation in a motor vehicle?" },
      { "id": 330, "text": "Had sex or been involved in oral sex or mutual masturbation in a land-based, non road dependant vehicle? (train, subway, roller coaster, monorail, disneyland ride, etc.)" },
      { "id": 331, "text": "Necked, petted, masturbated, been masturbated, or had sex or oral sex in a water based, manual powered vehicular transport medium, while it was in the water? (rowboat, surfboard, floating bathtub, etc.)" },
      { "id": 332, "text": "Necked, petted, masturbated, been masturbated, or had sex or oral sex in a water based, wind or propeller driven transport medium, while it was in the water? (yacht, sail boat, battleship, submarine, etc.)" },
      { "id": 333, "text": "Necked, petted, masturbated, been masturbated, or had sex or oral sex in an aircraft, while it was flying at the time? (airplane, helicopter, hovercraft, balloon, zeppelin, space shuttle, flying carpet, flying saucer, etc.)" },
      { "id": 334, "text": "Had sex in a household room other than a bedroom?" },
      { "id": 335, "text": "Had sex on the floor (but not the roof)?" },
      { "id": 336, "text": "Had sex on any furniture that is indoors but is not a bed, table, desk, countertop, nor anything that is predominantly used for sitting or as a table/desk? (television, washer/dryer, microwave, etc.)" },
      { "id": 337, "text": "Had sex, participated in oral sex, or participated in mutual masturbation in a telephone booth, voting booth, automatic photograph taker, or any such small, non-moving enclosure that was not designed for such activities?" },
      { "id": 338, "text": "Had sex, participated in oral sex, or participated in mutual masturbation in an elevator, people-mover, escalator, dumbwaiter, or any building-internal people moving device?" },
      { "id": 339, "text": "Had sex, participated in oral sex, or participated in mutual masturbation up a tree but not in a tree house or similar structure?" },
      { "id": 340, "text": "Had sex, oral sex, mutual masturbation in a suspension device of some kind (sex swing, hammock, trampoline, tightrope, safety net, etc.)?" },
      { "id": 341, "text": "Had sex, participated in oral sex, or participated in mutual masturbation on the roof of a building in excess of 5 floors?" },
      { "id": 342, "text": "Had sex, participated in oral sex, or participated in mutual masturbation inside or within the confines of a hedge, bush, other natural vegetation which can provide a wall effect? (cave, rock overhang, in a well, etc.)" },
      { "id": 343, "text": "Had sex, oral sex, or mutual masturbation in the snow? (spring thaw is acceptable.)" },
      { "id": 344, "text": "Had sex, oral sex, or mutual masturbation in a place where the prevailing, ambient temperature of the air immediately surrounding you was below the freezing point of water?" },
      { "id": 345, "text": "Had sex, participated in oral sex, or participated in mutual masturbation in a place where you could have been discovered?" },
      { "id": 346, "text": "Had sex, oral sex, or mutual masturbation in a water-filled bathtub, hot tub, or under a shower or other running water? (waterfall, torrential downpour, monsoon, etc.)" },
      { "id": 347, "text": "Had sex, oral sex, or mutual masturbation in a body of water? (swimming pool, swimming hole, pond, lake, lagoon, sea, ocean, etc.)" },
      { "id": 348, "text": "Had sex on the beach? (and the resultant sand in uncomfortable places)" },
      { "id": 349, "text": "Had sex, oral sex, or mutual masturbation in a bathroom of the opposite sex?" },
      { "id": 350, "text": "Gone to a motel, however sleazy, for the sole purpose of having sex?" }
    ]
  },
  {
    "section": 11,
    "title": "Style (We Know You Get Your Freak On, Now Tell Us How!)",
    "questions": [
      { "id": 351, "text": "Watched while someone else masturbated?" },
      { "id": 352, "text": "Been watched while masturbating?" },
      { "id": 353, "text": "Orgasmed on somebody?" },
      { "id": 354, "text": "Orgasmed in somebody if you are male, or had someone orgasm in you if you are female?" },
      { "id": 355, "text": "Had more than one person orgasm on/in you at once, or been one of several people orgasming on/in someone else?" },
      { "id": 356, "text": "Been involved in the use of a penis as a leash or bludgeoning device?" },
      { "id": 357, "text": "Been involved in oxygen deprivation for sexual enhancement?" },
      { "id": 358, "text": "Willingly made video tapes or had pictures taken while having sex, oral sex, or mutual masturbation?" },
      { "id": 359, "text": "Physically watched others having sex?" },
      { "id": 360, "text": "Watched your partner of choice having sex, oral sex, or mutual masturbation with someone else?" },
      { "id": 361, "text": "Taken pictures or made video tapes of your partner of choice having sex, oral sex, or mutual masturbation with someone else?" },
      { "id": 362, "text": "Willingly made audio recordings while having sex, oral sex, or mutual masturbation?" },
      { "id": 363, "text": "Talked dirty while having sex, oral sex, or mutual masturbation?" },
      { "id": 364, "text": "Intentionally made more noise than necessary while having sex, oral sex, or mutual masturbation so as to put on a good show for whoever might have been listening in?" },
      { "id": 365, "text": "Had a pet or domesticated animal walk over you or your partner while you were involved in sex or oral sex?" },
      { "id": 366, "text": "Had a general emergency arise while you were steeped in sex? (house on fire, flash flood, hurricane, private plane crash lands in your dwelling, earthquake, etc.)" },
      { "id": 367, "text": "Had your sexual technique/style/skill openly praised by someone?" },
      { "id": 368, "text": "Taken nude pictures of someone else?" },
      { "id": 369, "text": "Had nude pictures of you taken?" },
      { "id": 370, "text": "Been involved in breast fucking?" },
      { "id": 371, "text": "Participated in vaginal fist-fucking?" },
      { "id": 372, "text": "Participated in anal fist-fucking?" },
      { "id": 373, "text": "Shaved someone's genital pubic hair (or had yours shaved) as part of a sexual activity?" },
      { "id": 374, "text": "Had sex for more than three hours in a single session of sex?" },
      { "id": 375, "text": "Been bruised during sex, oral sex, or mutual masturbation? (hickies do not count)" },
      { "id": 376, "text": "Bruised someone else during sex, oral sex, or mutual masturbation?" },
      { "id": 377, "text": "Been injured during sex, oral sex, or mutual masturbation?" },
      { "id": 378, "text": "Orgasmed more than three times in one session of sex?" },
      { "id": 379, "text": "Had sex so many times, or for so long, that one or both people involved runs dry?" },
      { "id": 380, "text": "Disturbed other people by making excessive noise while having sex?" },
      { "id": 381, "text": "Had sex or mutual masturbation or received oral sex while you were driving (the car or boat or whatever vehicle)?" },
      { "id": 382, "text": "Had sex doggie fashion?" },
      { "id": 383, "text": "Had sex in the cowgirl position?" },
      { "id": 384, "text": "Had sex in the reverse cowgirl position?" },
      { "id": 385, "text": "Had sex sitting up?" },
      { "id": 386, "text": "Had sex standing up?" },
      { "id": 387, "text": "Gone through two or more sexual positions without the need for re-entry?" },
      { "id": 388, "text": "Fallen asleep during sex?" },
      { "id": 389, "text": "Woken up to someone having sex with you?" },
      { "id": 390, "text": "Had sex while one person was passed out or unconscious?" },
      { "id": 391, "text": "Given or received a hickey on your upper inner thigh?" },
      { "id": 392, "text": "Been on the receiving of anal sex?" },
      { "id": 393, "text": "Been on the slamming end of anal sex (a dildo counts)?" },
      { "id": 394, "text": "Had sex more than 10 times with 1 person?" },
      { "id": 395, "text": "Had sex more than 5 times in a 24 hour period?" },
      { "id": 396, "text": "Had sex more than 10 times in a 24 hour period?" },
      { "id": 397, "text": "Had sex, participated in oral sex, or participated in masturbation while someone other than your partner was watching?" },
      { "id": 398, "text": "Had sex or oral sex while one or both of you were playing a musical instrument, hacked, watched television, read, drawn or, in other words, were preoccupied with something other than sex and lust?" },
      { "id": 399, "text": "Performed oral sex after intercourse without washing or douching?" },
      { "id": 400, "text": "Kissed your partner on the lips after oral sex without brushing teeth, nor washing/gargling/rinsing out mouth?" },
      { "id": 401, "text": "Inflicted pain during sex?" },
      { "id": 402, "text": "Been involved in cunnilingus during the woman's period?" },
      { "id": 403, "text": "Had sex during the woman's period?" },
      { "id": 404, "text": "Foot masturbated someone?" },
      { "id": 405, "text": "Been foot masturbated?" },
      { "id": 406, "text": "Tongue bathed someone?" },
      { "id": 407, "text": "Been tongue bathed?" },
      { "id": 408, "text": "Licked or sucked on someone else's feet and/or toes?" },
      { "id": 409, "text": "Had your feet and/or toes licked or sucked by someone else?" },
      { "id": 410, "text": "Licked someone's anus?" },
      { "id": 411, "text": "Licked someone’s anus that was not freshly washed/showered?" },
      { "id": 412, "text": "Licked someone's anus while they were defecating?" },
      { "id": 413, "text": "Performed oral sex while the person was urinating?" },
      { "id": 414, "text": "Drank your own urine?" },
      { "id": 415, "text": "Tasted or drank someone else's urine?" },
      { "id": 416, "text": "Drank an entire bladder-full of someone else's urine?" },
      { "id": 417, "text": "Drank human blood?" },
      { "id": 418, "text": "Tasted someone else's nasal mucous?" },
      { "id": 419, "text": "Been involved in a golden shower?" },
      { "id": 420, "text": "Swallowed your partner's orgasmic secretions?" },
      { "id": 421, "text": "Used the purity test as a checklist of things you could do?" },
      { "id": 422, "text": "Ever done something for the sole purpose of lowering your purity test score?" },
      { "id": 423, "text": "Bought/read books to enhance sexual technique?" },
      { "id": 424, "text": "Participated in purity testing with an ulterior motive?" },
      { "id": 425, "text": "Become interested in someone only after hearing about their purity test score?" }
    ]
  }
]
